espressif/esp-idf/components/soc/esp32s2/include/soc/usb_dwc_struct.h
typedef union {
    struct {
        uint32_t epdir;
    };
    uint32_t val;
} usb_ghwcfg1_reg_t;

typedef union {
    struct {
        uint32_t otgmode: 3;
        uint32_t otgarch: 2;
        uint32_t singpnt: 1;
        uint32_t hsphytype: 2;
        uint32_t fsphytype: 2;
        uint32_t numdeveps: 4;
        uint32_t numhstchnl: 4;
        uint32_t periosupport: 1;
        uint32_t dynfifosizing: 1;
        uint32_t multiprocintrpt: 1;
        uint32_t reserved1a: 1;
        uint32_t nptxqdepth: 2;
        uint32_t ptxqdepth: 2;
        uint32_t tknqdepth: 5;
        uint32_t reserved1b: 1;
    };
    uint32_t val;
} usb_ghwcfg2_reg_t;

typedef union {
    struct {
        uint32_t xfersizewidth: 4;
        uint32_t pktsizewidth: 3;
        uint32_t otgen: 1;
        uint32_t i2cintsel: 1;
        uint32_t vndctlsupt: 1;
        uint32_t optfeature: 1;
        uint32_t rsttype: 1;
        uint32_t adpsupport: 1;
        uint32_t hsicmode: 1;
        uint32_t bcsupport: 1;
        uint32_t lpmmode: 1;
        uint32_t dfifodepth: 16;
    };
    uint32_t val;
} usb_ghwcfg3_reg_t;

typedef union {
    struct {
        uint32_t g_numdevperioeps: 4;
        uint32_t g_partialpwrdn: 1;
        uint32_t g_ahbfreq: 1;
        uint32_t g_hibernation: 1;
        uint32_t g_extendedhibernation: 1;
        uint32_t reserved4: 4;
        uint32_t g_acgsupt: 1;
        uint32_t g_enhancedlpmsupt: 1;
        uint32_t g_phydatawidth: 2;
        uint32_t g_numctleps: 4;
        uint32_t g_iddqfltr: 1;
        uint32_t g_vbusvalidfltr: 1;
        uint32_t g_avalidfltr: 1;
        uint32_t g_bvalidfltr: 1;
        uint32_t g_sessendfltr: 1;
        uint32_t g_dedfifomode: 1;
        uint32_t g_ineps: 4;
        uint32_t g_descdmaenabled: 1;
        uint32_t g_descdma: 1;
    };
    uint32_t val;
} usb_ghwcfg4_reg_t;

typedef union {
    struct {
        uint32_t gdfifocfg: 16;
        uint32_t epinfobaseaddr: 16;

    };
    uint32_t val;
} usb_gdfifocfg_reg_t;

typedef union {
    struct {
        uint32_t ptxfstaddr: 16;
        uint32_t ptxfsize: 16;
    };
    uint32_t val;
} usb_hptxfsiz_reg_t;

typedef union {
    struct {
        uint32_t inepitxfstaddr: 16;
        uint32_t inep1txfdep: 16;
    };
    uint32_t val;
} usb_dieptxfi_reg_t;

typedef union {
    struct {
        uint32_t fslspclksel: 2;
        uint32_t fslssupp: 1;
        uint32_t reserved4a: 4;
        uint32_t ena32khzs: 1;
        uint32_t resvalid: 8;
        uint32_t reserved1: 1;
        uint32_t reserved6: 6;
        uint32_t descdma: 1;
        uint32_t frlisten: 2;
        uint32_t perschedena: 1;
        uint32_t reserved4b: 4;
        uint32_t modechtimen: 1;
    };
    uint32_t val;
} usb_hcfg_reg_t;

typedef union {
    struct {
        uint32_t frint: 16;
        uint32_t hfirrldctrl: 1;
        uint32_t reserved15: 15;
    };
    uint32_t val;
} usb_hfir_reg_t;

typedef union {
    struct {
        uint32_t frnum: 14;
        uint32_t reserved: 2;
        uint32_t frrem: 16;
    };
    uint32_t val;
} usb_hfnum_reg_t;

typedef union {
    struct {
        uint32_t ptxfspcavail: 16;
        uint32_t ptxqspcavail: 5;
        uint32_t reserved: 3;
        uint32_t ptxqtop: 8;
    };
    uint32_t val;
} usb_hptxsts_reg_t;

typedef union {
    struct {
        uint32_t haint: 8;
        uint32_t reserved24: 24;
    };
    uint32_t val;
} usb_haint_reg_t;

typedef union {
    struct {
        uint32_t haintmsk: 8;
        uint32_t reserved24: 24;
    };
    uint32_t val;
} usb_haintmsk_reg_t;

typedef union {
    struct {
        uint32_t hflbaddr;
    };
    uint32_t val;
} usb_hflbaddr_reg_t;

typedef union {
    struct {
        uint32_t prtconnsts: 1;
        uint32_t prtconndet: 1;
        uint32_t prtena: 1;
        uint32_t prtenchng: 1;
        uint32_t prtovrcurract: 1;
        uint32_t prtovrcurrchng: 1;
        uint32_t prtres: 1;
        uint32_t prtsusp: 1;
        uint32_t prtrst: 1;
        uint32_t reserved1: 1;
        uint32_t prtlnsts: 2;
        uint32_t prtpwr: 1;
        uint32_t prttstctl: 4;
        uint32_t prtspd: 2;
        uint32_t reserved13: 13;
    };
    uint32_t val;
} usb_hprt_reg_t;

typedef union {
    struct {
        uint32_t mps: 11;
        uint32_t epnum: 4;
        uint32_t epdir: 1;
        uint32_t reserved: 1;
        uint32_t lspddev: 1;
        uint32_t eptype: 2;
        uint32_t ec: 2;
        uint32_t devaddr: 7;
        uint32_t oddfrm: 1;
        uint32_t chdis: 1;
        uint32_t chena: 1;
    };
    uint32_t val;
    //Checked with changes
} usb_hcchar_reg_t;

typedef union {
    struct {
        uint32_t xfercompl: 1;
        uint32_t chhltd: 1;
        uint32_t ahberr: 1;
        uint32_t stall: 1;
        uint32_t nack: 1;
        uint32_t ack: 1;
        uint32_t nyet: 1;
        uint32_t xacterr: 1;
        uint32_t bblerr: 1;
        uint32_t frmovrun: 1;
        uint32_t datatglerr: 1;
        uint32_t bnaintr: 1;
        uint32_t xcs_xact_err: 1;
        uint32_t desc_lst_rollintr: 1;
        uint32_t reserved18: 18;
    };
    uint32_t val;
    //Checked
} usb_hcint_reg_t;

typedef union {
    struct {
        uint32_t xfercomplmsk: 1;
        uint32_t chhltdmsk: 1;
        uint32_t ahberrmsk: 1;
        uint32_t stallmsk: 1;
        uint32_t nakmsk: 1;
        uint32_t ackmsk: 1;
        uint32_t nyetmsk: 1;
        uint32_t xacterrmsk: 1;
        uint32_t bblerrmsk: 1;
        uint32_t frmovrunmsk: 1;
        uint32_t datatglerrmsk: 1;
        uint32_t bnaintrmsk: 1;
        uint32_t reserved1: 1;
        uint32_t desc_lst_rollintrmsk: 1;
        uint32_t reserved18: 18;
    };
    uint32_t val;
    //Checked
} usb_hcintmsk_reg_t;

typedef union {
    struct {
        uint32_t sched_info: 8;
        uint32_t ntd: 8;
        uint32_t reserved3: 3;
        uint32_t reserved10: 10;
        uint32_t pid: 2;
        uint32_t dopng: 1;
    };
    uint32_t val;
    //Checked
} usb_hctsiz_reg_t;

typedef union {
    struct {
        uint32_t reserved3: 3;
        uint32_t ctd: 6;
        uint32_t dmaaddr: 23;
    } non_iso;
    struct {
        uint32_t reserved3: 3;
        uint32_t dmaaddr_ctd: 29;
    } iso;
    uint32_t val;
    //Checked
} usb_hcdma_reg_t;

