espressif/esp-idf/components/soc/esp32s2/include/soc/usb_dwc_struct.h
typedef struct {
    volatile usb_doepctl_reg_t doepctl_reg;  //0x00
    uint32_t reserved_0x04_0x08[1]; //0x04
    volatile usb_doepint_reg_t doepint_reg;  //0x08
    uint32_t reserved_0x0c_0x10[1]; //0x0c
    volatile usb_doeptsiz_reg_t doeptsiz_reg;    //0x10
    volatile usb_doepdma_reg_t doepdma_reg;  //0x14
    uint32_t reserved_0x18_0x1c[1]; //0x18
    volatile usb_doepdmab_reg_t doepdmab_reg;    //0x1c
} usb_out_ep_regs_t;

/* --------------------------- Register Layout ------------------------------ */

typedef struct {
    //Global Registers
    volatile usb_gotgctl_reg_t gotgctl_reg;             //0x0000
    volatile usb_gotgint_reg_t gotgint_reg;             //0x0004
    volatile usb_gahbcfg_reg_t gahbcfg_reg;             //0x0008
    volatile usb_gusbcfg_reg_t gusbcfg_reg;             //0x000c
    volatile usb_grstctl_reg_t grstctl_reg;             //0x0010
    volatile usb_gintsts_reg_t gintsts_reg;             //0x0014
    volatile usb_gintmsk_reg_t gintmsk_reg;             //0x0018
    volatile usb_grxstsr_reg_t grxstsr_reg;             //0x001c
    volatile usb_grxstsp_reg_t grxstsp_reg;             //0x0020
    volatile usb_grxfsiz_reg_t grxfsiz_reg;             //0x0024
    volatile usb_gnptxfsiz_reg_t gnptxfsiz_reg;         //0x0028
    volatile usb_gnptxsts_reg_t gnptxsts_reg;           //0x002c
    uint32_t reserved_0x0030_0x0040[4];                 //0x0030 to 0x0040
    volatile usb_gsnpsid_reg_t gsnpsid_reg;             //0x0040
    volatile usb_ghwcfg1_reg_t ghwcfg1_reg;             //0x0044
    volatile usb_ghwcfg2_reg_t ghwcfg2_reg;             //0x0048
    volatile usb_ghwcfg3_reg_t ghwcfg3_reg;             //0x004c
    volatile usb_ghwcfg4_reg_t ghwcfg4_reg;             //0x0050
    uint32_t reserved_0x0054_0x005c[2];                 //0x0054 to 0x005c

    //FIFO Configurations
    volatile usb_gdfifocfg_reg_t gdfifocfg_reg;         //0x005c
    uint32_t reserved_0x0060_0x0100[40];                //0x0060 to 0x0100
    volatile usb_hptxfsiz_reg_t hptxfsiz_reg;           //0x0100
    volatile usb_dieptxfi_reg_t dieptxfi_regs[4];       //0x0104 to 0x0114
    usb_dieptxfi_reg_t reserved_0x0114_0x0140[11];      //0x0114 to 0x0140
    uint32_t reserved_0x140_0x400[176];                 //0x0140 to 0x0400

    //Host Mode Registers
    volatile usb_hcfg_reg_t hcfg_reg;                   //0x0400
    volatile usb_hfir_reg_t hfir_reg;                   //0x0404
    volatile usb_hfnum_reg_t hfnum_reg;                 //0x0408
    uint32_t reserved_0x40c_0x410[1];                   //0x040c to 0x0410
    volatile usb_hptxsts_reg_t hptxsts_reg;             //0x0410
    volatile usb_haint_reg_t haint_reg;                 //0x0414
    volatile usb_haintmsk_reg_t haintmsk_reg;           //0x0418
    volatile usb_hflbaddr_reg_t hflbaddr_reg;           //0x041c
    uint32_t reserved_0x420_0x440[8];                   //0x0420 to 0x0440
    volatile usb_hprt_reg_t hprt_reg;                   //0x0440
    uint32_t reserved_0x0444_0x0500[47];                //0x0444 to 0x0500
    usb_host_chan_regs_t host_chans[8];                 //0x0500 to 0x0600
    usb_host_chan_regs_t reserved_0x0600_0x0700[8];     //0x0600 to 0x0700
    uint32_t reserved_0x0700_0x0800[64];                //0x0700 to 0x0800
    volatile usb_dcfg_reg_t dcfg_reg;                   //0x0800
    volatile usb_dctl_reg_t dctl_reg;                   //0x0804
    volatile usb_dsts_reg_t dsts_reg;                   //0x0808
    uint32_t reserved_0x080c_0x0810[1];                 //0x080c to 0x0810

    //Device Mode Registers
    volatile usb_diepmsk_reg_t diepmsk_reg;             //0x810
    volatile usb_doepmsk_reg_t doepmsk_reg;             //0x0814
    volatile usb_daint_reg_t daint_reg;                 //0x0818
    volatile usb_daintmsk_reg_t daintmsk_reg;           //0x081c
    uint32_t reserved_0x0820_0x0828[2];                 //0x0820 to 0x0828
    volatile usb_dvbusdis_reg_t dvbusdis_reg;           //0x0828
    volatile usb_dvbuspulse_reg_t dvbuspulse_reg;       //0x082c
    volatile usb_dthrctl_reg_t dthrctl_reg;             //0x0830
    volatile usb_diepempmsk_reg_t diepempmsk_reg;       //0x0834
    uint32_t reserved_0x0838_0x0900[50];                //0x0838 to 0x0900

    //Deivce: IN EP0 reigsters
    volatile usb_diepctl0_reg_t diepctl0_reg;           //0x0900
    uint32_t reserved_0x0904_0x0908[1];                 //0x0904 to 0x0908
    volatile usb_diepint0_reg_t diepint0_reg;           //0x0908
    uint32_t reserved_0x090c_0x0910[1];                 //0x090c to 0x0910
    volatile usb_dieptsiz0_reg_t dieptsiz0_reg;         //0x0910
    volatile usb_diepdma0_reg_t diepdma0_reg;           //0x0914
    volatile usb_dtxfsts0_reg_t dtxfsts0_reg;           //0x0918
    volatile usb_diepdmab0_reg_t diepdmab0_reg;         //0x091c

    //Deivce: IN EP registers
    usb_in_ep_regs_t in_eps[6];                         //0x0920 to 0x09e0
    usb_in_ep_regs_t reserved_0x09e0_0x0b00[9];         //0x09e0 to 0x0b00

    //Device: OUT EP0 reigsters
    volatile usb_doepctl0_reg_t doepctl0_reg;           //0x0b00
    uint32_t reserved_0x0b04_0x0b08[1];                 //0x0b04 to 0x0b08
    volatile usb_doepint0_reg_t doepint0_reg;           //0b0b08
    uint32_t reserved_0x0b0c_0x0b10[1];                 //0x0b0c to 0x0b10
    volatile usb_doeptsiz0_reg_t doeptsiz0_reg;         //0x0b10
    volatile usb_doepdma0_reg_t doepdma0_reg;           //0x0b14
    uint32_t reserved_0x0b18_0x0b1c[1];                 //0x0b18 to 0x0b1c
    volatile usb_doepdmab0_reg_t doepdmab0_reg;         //0x0b1c

    //Deivce: OUT EP registers
    usb_out_ep_regs_t out_eps[6];                       //0xb1c
    usb_out_ep_regs_t reserved_0x0be0_0x0d00[9];        //0x0be0 to 0x0d00
    uint32_t reserved_0x0d00_0x0e00[64];                //0x0d00 to 0x0e00
    volatile usb_pcgcctl_reg_t pcgcctl_reg;             //0x0e00
    uint32_t reserved_0x0e04_0x0e08[1];                 //0x0d00 to 0x0e00
} usbh_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(usbh_dev_t) == 0xe08, "Invalid size of usb_dwc_dev_t structure");
#endif

extern usbh_dev_t USBH;


#ifdef __cplusplus
}
#endif
